{"#### Q1. To mount a drive by its ID, what command would you use first to retrieve it?\n": ["- [ ] df -h\n", "- [ ] listid\n", "- [ ] ls -l\n", "- [x] blkid\n"], "#### Q2. Linux file access control lists (ACLs) are \\_.\n": ["- [x] discretionary access control system permissions layered over standard Linux permissions\n", "- [ ] mandatory access control system permissions layered over standard Linux permissions\n", "- [ ] a type of firewall for Linux\n", "- [ ] the same as standard Linux permissions\n"], "#### Q3. When using iproute2, how do you show routing information for an IPv6 network?\n": ["- [ ] route -ipv6\n", "- [ ] route\n", "- [x] ip -6 route show\n", "- [ ] ip route show\n"], "#### Q4. What does this command string do?\n bash \n find / -size +10M -exec ls -l {} ;\n": ["- [ ] It finds all files using ls -l and hands them off to the find command to display.\n", "- [ ] It finds all files older than 10 minutes and long lists them using the ls command.\n", "- [x] It finds all files larger than 10 MB and long lists them using the ls command.\n", "- [ ] It uses the ls command to find all files in the filesystem matching the {} wildcard.\n"], "#### Q5. What would this locate command show?\nbash\n locate --regexp '^/usr.*pixmaps.*jpg$'\n": ["- [ ] all files in a directory named pixmaps\n", "- [ ] all files ending in \".jpg\"\n", "- [x] all file paths that start with \"/usr\", include the word \"pixmaps\", and end with \".jpg\"\n", "- [ ] all file paths that include \"/usr/pixmaps\" and end with \".jpg\"\n"], "#### Q6. Which command allows you to do packet analysis from the command line?\n": ["- [ ] wireshark\n", "- [ ] ethtool\n", "- [ ] netstat\n", "- [x] tcpdump\n"], "#### Q7. Which command will tell you how long a system has been running?\n": ["- [ ] log\n", "- [x] uptime\n", "- [ ] runtime\n", "- [ ] access\n"], "#### Q8. How would you describe PCP (Performance Co-Pilot)?\n": ["- [ ] It is an application testing suite used to profile programming code.\n", "- [ ] It is a local command used for monitoring local system resources in real time.\n", "- [x] It is a set of tools, services, and libraries for gathering and analyzing performance measures.\n", "- [ ] It is a tool designed to change system configuration for purposes of optimization.\n"], "#### Q9. You want to resolve a long list of DNS names using dig. What should you do?\n": ["- [x] Create a text file including all names and use the -f option of dig.\n", "- [ ] Type in each query manually.\n", "- [ ] Write a shell script to send multiple dig queries to the DNS server.\n", "- [ ] Save the DNS names in an SQL database and process it with dig.\n"], "#### Q10. What would this command output?\nps -e --format uid,pid,ppid,%cpu,cmd\n": ["- [x] the user ID, process ID, parent process ID, CPU usage, and command name of a process\n", "- [ ] the user ID, group ID, parent process ID, CPU usage, and command name of a process\n", "- [ ] the UUID, process ID, parent process ID, CPU usage, and command name of a process\n", "- [ ] all of these answers\n"], "#### Q11. Which command in Bash executes the last line in the shell history that starts with ls?\n": ["- [ ] !\n", "- [ ] !!\n", "- [ ] !\\*\n", "- [x] !ls\n"], "#### Q12. The ssh-copy-id command copies \\_ to the remote host.\n": ["- [ ] both private and public keys\n", "- [x] the ssh public key\n", "- [ ] the ssh private key\n", "- [ ] a fingerprint file\n"], "#### Q13. What command is used to determine the amount of disk usage for a directory?\n": ["- [ ] find\n", "- [ ] fdisk\n", "- [x] du\n", "- [ ] df\n"], "#### Q14. A backup drive was created using dd to make a bit-for-bit copy. When the drive is inserted into an iSCSI target before it is booted up, the data appears to be missing. What happened?\n": ["- [ ] The backup drive is corrupted and needs to be re-created.\n", "- [x] When the backup drive was duplicates, the label was as well. When booted, the system mounted the old duplicates drive by its identical label.\n", "- [ ] There is a conflict between the physical location of the backup drive and the original drive.\n", "- [ ] The backup process went wrong, and the old drive was duplicates over the original drive.\n"], "#### Q15. What is the key difference between a redirect (>) and piping to the tee command?\n": ["- [ ] The tee command sends output only to STDOUT and STDERR.\n", "- [ ] A redirect sends output to STDOUT and a file, whereas a tee sends output only to STDOUT.\n", "- [ ] Nothing, they are the same.\n", "- [x] The tee command sends output to STDOUT and a file, whereas a redirect sends output only to a file.\n"], "#### Q16. What does the /etc/nsswitch.conf file manage?\n": ["- [ ] priority of one DNS server over another\n", "- [ ] per network interface DNS server configuration\n", "- [ ] alternative DNS services\n", "- [x] sources for name service information\n"], "#### Q17. Assume the variable myNumber holds a string consisting of 10 digits. What will this command output?\n bash \n echo $myNumber | sed -e '^[[:digit:]][[:digit:]][[:digit:]]/(&)/g' ": ["- [ ] It will only match digits—and since the string has only digits, the command will output the same number without changes.\n", "- [ ] It will output the same 10-digit number, but every digit will be inside parentheses.\n", "- [ ] It will output the entire 10-digit number inside parentheses.\n", "- [x] It will output the same 10-digit number, but the first 3 digits will be inside parentheses.\n"], "#### Q18. Packages can be downloaded but not installed with yum or dnf by specifying which option?\n": ["- [ ] None of these answers. yum does not support downloading packages without installing them.\n", "- [ ] --downloaddir\n", "- [ ] -d\n", "- [x] --downloadonly\n"], "#### Q19. What character class is equal to this set?\n `[0-9]`\n": ["- [ ] `[[:alnum:]]`\n", "- [x] `[[:digit:]]`\n", "- [ ] `[[:alpha:]]`\n", "- [ ] `[[:num:]]`\n"], "#### Q20. When archiving files, which command will preserve all file attributes including ACLs and SELinux security context?\n": ["- [ ] zip\n", "- [x] tar\n", "- [ ] archive\n", "- [ ] gzip\n"], "#### Q21. In a systemd-based OS, you can change the system hostname by editing /etc/hostname manually and then doing what?\n": ["- [ ] Restart dhcpd.\n", "- [ ] Run /etc/hostname.\n", "- [x] Nothing, the system notices automatically.\n", "- [ ] Notify systemd to update it by restarting the systemd-hostnamed service.\n"], "#### Q22. What command would you use to resize an LVM volume group to include an additional physical volume?\n": ["- [ ] vgadd\n", "- [ ] vgresize\n", "- [ ] vgappend\n", "- [x] vgextend\n"], "#### Q23. When would this system cron job run its task?\n ": ["- [ ] every minute of the hour\n", "- [ ] every hour of every day\n", "- [x] every day at 1:00 AM\n", "- [ ] only on Mondays\n"], "#### Q24. ifconfig has been deprecated. What command is now recommended for changing IP addresses in the live config?\n": ["- [ ] netconf\n", "- [ ] ipconfig\n", "- [ ] ipman\n", "- [x] ip\n"], "#### Q25. You are managing an Apache web server on a system using SELinux. By default it cannot read personal webpages in users' home directories. What SELinux boolean would you set to allow this?\n": ["- [ ] apache_enable_homedirs\n", "- [ ] httpd_enable_userdirs\n", "- [x] httpd_enable_homedirs\n", "- [ ] httpd_enable_userhome_dirs\n"], "#### Q26. Why doesn't passwd -l keep a user from logging in via other methods?\n": ["- [ ] The passwd command is not used for locking passwords.\n", "- [ ] There is no password -l option.\n", "- [x] It locks only the password, not the account, so users can still authenticate with keys or other methods.\n", "- [ ] It does lock the account, keeping users from logging in even if they are using other authentication methods.\n"], "#### Q27. In the Bash shell, what is the difference between piping into | and piping into |&?\n": ["- [ ] Piping into | pipes both stdout and stderr. Piping into |& pipes only stderr.\n", "- [x] Piping into | pipes stdout. Piping into |& pipes stdout and stderr.\n", "- [ ] Piping into | pipes both stdout and stderr. Piping into |& pipes only stdout.\n", "- [ ] Piping into | pipes stdout. Piping into |& pipes all open file descriptors.\n"], "#### Q28. Why is the passwd command able to modify the /etc/passwd file?\n": ["- [ ] The kernel identifies it as one of the names of extended commands.\n", "- [ ] It has the same name as the file it modifies.\n", "- [x] It has the SUID permission mode and is owned by root.\n", "- [ ] It is a system administration command.\n"], "#### Q29. When a user deletes a file using the rm command, Linux will \\_.\n": ["- [ ] always ask for confirmation\n", "- [ ] back up the file before it deletes the file\n", "- [x] ask for confirmation if configured to do so\n", "- [ ] never ask for confirmation\n"], "#### Q30. What is a major advantage of using Logical Volume Management (LVM)?\n": ["- [ ] Access to a drive is faster than with standard partitions.\n", "- [ ] Volumes can be resized smaller without unmounting them.\n", "- [ ] Repairing filesystem errors is easier than with standard partitions.\n", "- [x] Volumes can be resized even if the free space is not contiguous.\n"], "#### Q31. What is one major difference between brace expansion and globs?\n": ["- [ ] Globs create a list; brace expansion matches pattern.\n", "- [ ] Brace expansion requires files to exist; globs do not.\n", "- [x] Brace expansion creates a list; globs match the list of pathnames.\n", "- [ ] Globs get processes first and brace expansion later.\n"], "#### Q32. To remove all ACLs from a directory , use setfacl with which options?\n": ["- [ ] -d\n", "- [ ] -k\n", "- [x] -b\n", "- [ ] -x\n"], "#### Q33. Which choice will _not_ print \"Hello World\" in the terminal?\n": ["- [ ] A\n bash \n myVar = 5 \n[[ $myVar -lt 10 ]] && echo 'Hello World'\n", "- [x] B\n bash\n myVar = 5 \n [[ $myVar -lt 10 ]] || echo  'Hello World'\n", "- [ ] C\n bash \n myVar = 5 \n [[ ! $myVar -gt 10 ]] && echo 'Hello World'\n", "- [ ] D\n bash\n myVar = 5\n [[ $myVar -gt 10 ]] || echo 'Hello World'\n"], "#### Q34. What is not inherited by child process?\n": ["- [x] shell aliases\n", "- [ ] userid\n", "- [ ] environmental variables\n", "- [ ] scheduling priority\n"], "#### Q35. What NFS option allows the root user to access NFS shares as the root user?\n": ["- [ ] no_admin_squash\n", "- [x] no_root_squash\n", "- [ ] allow_root_access\n", "- [ ] all_squash\n"], "#### Q36. You send an email to a remote client using the following syntax. What will be in the body of the email?\n bash \n date | mail -s 'This is a remote test' user1@rhhost1.localnet.com\n": ["- [ ] \"This is a remote test\"\n", "- [ ] the date, the time, and the words \"This is a remote test\"\n", "- [ ] The email subject shows \"This is a remote test\" but the body of the email will be empty.\n", "- [x] the current date and time\n"], "#### Q37. What is the /etc/hosts file used for?\n": ["- [ ] resolving the local name\n", "- [ ] blocking sites using iptables\n", "- [ ] setting the hostname\n", "- [x] configuring DNS name servers\n"], "#### Q38. In an extended regular expression, you would use (pattern){3} to match three instances of the pattern. How would you match the same thing with an extended glob?\n": ["- [ ] 3(pattern)\n", "- [ ] {0,3}(pattern}\n", "- [x] Occurrence quantifiers are not supported in Bash's version of extended globs, so this is not possible.\n", "- [ ] {3}(pattern})\n"], "#### Q39. When configuring a Samba share, how would the engineering group be specified in the smb.conf?\n": ["- [ ] Samba uses Linux operating system groups from the /etc/group file; just specify the group name.\n", "- [ ] It would be preceded by a percent sign (%), such as %engineers.\n", "- [ ] Use the group name by itself; Samba checks for its existence.\n", "- [x] It would be preceded by an @ symbol, such as @engineering.\n"], "#### Q40. To configure the Kerberos client, which command should you use to import the keytab file?\n": ["- [ ] krb5-workstation\n", "- [x] ktutil\n", "- [ ] pam_krb5\n", "- [ ] kdb5_util\n"], "#### Q41. To search from the current cursor position up to the beginning of the file using VIM, type \\_ and then the search criteria.\n": ["- [x] `?`\n", "- [ ] `\\`\n", "- [ ] `/`\n", "- [ ] `/search`\n"], "#### Q42. What is the job of the NetworkManager daemon?\n": ["- [ ] It is a graphical tool that manages network connections, including bonding and wireless networks.\n", "- [ ] It is a security service that manages user access control of local network-aware services.\n", "- [ ] It attempts to keep an active network connection available at all times.\n", "- [x] It is a command-line tool that manages network connections.\n"], "#### Q43. Why might would you use the usermod command ?\n": ["- [ ] to log out a user\n", "- [ ] to lock a user's account\n", "- [x] to change global user account settings\n", "- [ ] to set a user's password\n"], "#### Q44. Extending an LVM volume group does what to the formatted filesystem?\n": ["- [ ] It prepares the filesystem for use by defragmenting it.\n", "- [ ] It resizes the filesystem to match the volume group size.\n", "- [x] It does nothing.\n", "- [ ] It remounts the filesystem with the new size.\n"], "#### Q45. What would this sed command do?\n bash\n sed -E 's/[a-Z]{4}/(&)/'  textfile.txt\n": ["- [ ] It would substitute the letter with an ampersand (&).\n", "- [ ] It would replace all letters in the textfile.txt file with ampersand (&).\n", "- [x] It would replace the first four letters with an ampersand (&).\n", "- [ ] It would place parentheses around the first four letters of each line of textfile.txt.\n"], "#### Q46. Which kernel module do you need to load to use interface bonding?\n": ["- [x] bonding.\n", "- [ ] team.\n", "- [ ] netbond.\n", "- [ ] bond.\n"], "#### Q47. What does this command string do?\n bash\n find / -size -10K -exec ls -l {} ;\n": ["- [ ] It finds all files larger than 10k and long lists them using the ls command.\n", "- [ ] It finds all files of size 10k using ls -l and hands them off to the find command to display.\n", "- [ ] It finds all files in the / directory of size 10k and long lists them.\n", "- [x] It finds all files in the file system smaller than 10k and long lists them using the ls command.\n"], "#### Q48. To change the priority of multiple swap partitions, which file would you edit?\n": ["- [ ] /proc/swapiness\n", "- [x] /etc/fstab\n", "- [ ] /etc/mounts\n", "- [ ] /etc/swaps\n"], "#### Q49. What would you type to list all systemd service unit files, whether they are enabled or not?\n": ["- [ ] systemctl list-services.\n", "- [ ] chkconfig --list-all\n", "- [x] systemctl list-unit-files -at service\n", "- [ ] systemctl list-unit-files -t service\n"], "#### Q50. You can set Linux group passwords using which command?\n": ["- [x] gpasswd\n", "- [ ] passwd\n", "- [ ] editsam\n", "- [ ] grouppass\n"], "#### Q51. With most GNU commands, if an option is a word, what will it be preceded by?\n": ["- [x] two dashes\n", "- [ ] a backslash\n", "- [ ] one dash\n", "- [ ] nothing\n"], "#### Q52. What would happen if you have a script file named script that takes a long time to complete, and you type `nohup ./script &` in the command line?\n": ["- [ ] The script will remain running in the background even if you reboot the system.\n", "- [ ] The script will run in your terminal and you will not be able to do anything until it completes.\n", "- [x] The script will run in the background until you end the session.\n", "- [ ] The script will run in the background and will continue running even if you end the session.\n"], "#### Q53. To elevate privileges using the `sudo` command, a user must **\\_**.\n": ["- [ ] enter the root user's password\n", "- [x] enter their own password\n", "- [ ] enter the sudo user's password\n", "- [ ] change to the root group\n","[A Cloud Guru's Blog](https://acloudguru.com/blog/engineering/linux-commands-for-beginners-sudo#:~:text=Sudo%20asks%20for%20your%20user%20password.%C2%A0%20Note%20that%20it%20is%20asking%20for%20your%20password%2C%20not%20the%20root%20password.)\n"], "#### Q54. When would this system cron job run its task?\n `0 22 * * 1-5`\n": ["- [ ] on the 22nd of every month from June to May\n", "- [x] at 10:00 PM Monday to Friday\n", "- [ ] every 22 minutes every day except weekends\n", "- [ ] from 1:00 AM to 5:00 AM on the 22nd of every month\n"], "#### Q55. How does TCP Wrappers differ from a firewall?\n": ["- [ ] Firewalls are only service specific, whereas TCP Wrappers can block all traffic.\n", "- [ ] TCP Wrappers works at the network layer, so it blocks traffic before the firewall even sees it.\n", "- [ ] Firewalls easily spawn commands to operate on connection data, whereas TCP Wrappers cannot.\n", "- [x] TCP Wrappers works at the application layer, so it can make access decisions on encrypted data.\n","**Note:** TCP Wrapper works on Application Layer but answer is not too much confirmed.\n"], "#### Q56. As root, you set execute permissions for user, group, and other on a directory. Now users can do what?\n": ["- [ ] They can execute files in it.\n", "- [x] They can traverse it.\n", "- [ ] They can read files in it.\n", "- [ ] They can delete files in it.\n","**Note:** This is correct because of the keyword 'directory'. More info at: https://www.tutorialspoint.com/unix/unix-file-permission.htm\n"], "#### Q57. What will this command print?\n `echo 'Thu Jun 4 15:45:45 PDT 2020' | cut -f3 -d' '`\n": ["- [ ] It will print nothing.\n", "- [ ] Thu Jun 4 15:45:45 PDT 2020\n", "- [ ] 0.6567708333333333\n", "- [x] 4\n"], "#### Q58. How can you improve this code snippet?\n if ls /etc/passwd &> /dev/null \n then \n echo 'exists'\n fi\n": ["- [ ] The code snippet cannot be improved, this is a valid way of checking for the existence of a file.\n", "- [x] Use Bash's built-in `[[ ]]` test conditions instead of the ls command.\n", "- [ ] The redirect to `/dev/null` will silence the return code invalidating the conditional. Removing the redirect will solve this.\n", "- [ ] The ls command will output the name of the file to the screen. Running ls in quiet mode will improve the code snippet.\n"], "#### Q59. Using a systemd-based distribution, you want to restrict the cron service from running either automatically or manually. Which command would you run?\n": ["- [ ] systemctl disable crond\n", "- [ ] systemctl disallow crond\n", "- [x] systemctl mask crond\n", "- [ ] systemctl stop crond\n","**Note:** This is the correct answer because 'mask' prohibits all kinds of activation of the unit, including manual activation. \n[Reference](https://www.commandlinux.com/man-page/man1/systemctl.1.html) : search 'mask'.\n"], "#### Q60. What issue might a user have when they mount a filesystem by partition path such as /dev/sdal in the /etc/fstab file?\n": ["- [x] The device order may change on boot, resulting in a system that will not boot properly.\n", "- [ ] The user may run out of device letters.\n", "- [ ] There are no issues with referring to partitions by their partition path.\n", "- [ ] It is more difficult identifying mounted devices by partition path.\n","[Reference](https://access.redhat.com/discussions/6004221)\n"], "#### Q61. Which option would you choose to force grep to use a basic regular expression (BRE)?\n": ["- [ ] grep -E\n", "- [ ] grep -B\n", "- [ ] grep -e\n", "- [x] grep -G\n","**Explanation**: Man page of grep command.\n"], "#### Q62. An rsyslogd filter determines which items in a log file to act on. What is it made up of?\n": ["- [ ] a facility and an action\n", "- [x] a filter and an action\n", "- [ ] a facility and a priority\n", "- [ ] a filter and a priority\n","[Reference](https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html/system_administrators_guide/ch-viewing_and_managing_log_files)\n"], "#### Q63. Which choice is a Network Manager tool used to configure network connections from the GUI?\n": ["- [ ] nmcli\n", "- [ ] ip\n", "- [ ] Onmtui\n", "- [x] nm-connection-editor\n"], "#### Q64. What will not happen if you run the make command without parameters?\n": ["- [x] It will clean up all previously generated binaries and perform a new build.\n", "- [ ] It will run rules of compilation and building.\n", "- [ ] It will look for a file called makefile in your current directory.\n", "- [ ] It will build only programs that need to be rebuilt.\n"], "#### Q65. Most commands that support SELinux use which option to display SELinux security context?\n": ["- [ ] -S\n", "- [ ] --selinux\n", "- [ ] --MAC\n", "- [x] -Z\n"], "#### Q66. What is the difference between the whoami and logname commands?\n": ["- [ ] whoami and logname provide the same information.\n", "- [x] whoami tells who are you currently, and logname tells who you were when you logged in initially.\n", "- [ ] logname specifies the name of the login log file, and whoami prints the logged in username.\n", "- [ ] whoami shows you who logged in as initially, and logname shows who are you currently.\n"], "#### Q67. What is the command to create an associative array in Bash?\n": ["- [ ] declare -a\n", "- [ ] aarray\n", "- [ ] array -a\n", "- [x] declare -A\n"], "#### Q68. What tool Should you use to replace a physical volum in LVM?\n": ["- [ ] lvcopy\n", "- [ ] tar\n", "- [x] pvmove\n", "- [ ] cp\n"], "#### Q69. What is the difference the `==` and `=~` comparison operators when used in BASH double square bracket `if` conditionals?\n": ["- [x] The `==` operator performs a string comparison; `=~` performs a regex comparison.\n", "- [ ] The `==` operator performs a string comparison; `=~` performs a glob pattern comparison.\n", "- [ ] The `=~` operator performs a string comparison; `==` performs a regex comparison.\n", "- [ ] There is no `=~` operator in BASH `if` conditionals.\n"], "#### Q70. What is the difference between these two lines of code?\n shell\n echo 'data' | tee -a file.txt\n echo 'data' >> file.txt\n": ["- [x] The first line will append the word `data` to file.txt and output it on the screen. The second line will append the word `data` only to file.txt.\n", "- [ ] They are the same.\n", "- [ ] The first line will append the word `data` to file.txt and there will be no output on the screen. The second line will output the word `data` on the screen and append it to `file.txt`\n", "- [ ] Both lines will overwrite file.txt with the word data.\n"], "#### Q71. Using backreferences in a POSIX regular expression, which word would this pattern match?\n shell\n (ss).*1 \n": ["- [ ] addressee\n", "- [x] possess\n", "- [ ] barrenness\n", "- [ ] successfully\n"], "#### Q72. To run CGI scripts with Apache, you need to **\\_**.\n": ["- [ ] compile the script with a CGI compiler\n", "- [ ] make the script executable\n", "- [x] make the script executable and set the `httpd_enable_cgi` SELinux boolean\n", "- [ ] change the ownership of the script to Apache\n","[reference here](https://selinuxproject.org/page/ApacheRecipes#Allow_the_Apache_HTTP_Server_to_run_CGI_scripts)\n"], "#### Q73. To permanently add NAT to the default zone using firewalld, you would use which command string?\n": ["- [ ] `firewall-cmd --permanent --add-nat`\n", "- [x] `firewall-cmd --permanent --add-masquerade`\n", "- [ ] `firewall-cmd --zone=default --add-nat`\n", "- [ ] `firewall-cmd --zone=default --add-masquerade`\n","[reference here](https://www.rootusers.com/how-to-use-firewalld-rich-rules-and-zones-for-filtering-and-nat)\n"], "#### Q74. What is the difference between using `=` and `==` in a BASH double square bracket `if` conditional?\n if [[ $FILE == $GLOB ]] ;then\n": ["- [ ] The single equal sign (`=`) is an assignment operator; the double equal sign (`==`) checks equality.\n", "- [x] There is no difference.\n", "- [ ] The single equal sign (`=`) checks equality; the double equal sign (`==`) checks string equality.\n", "- [ ] The double equal sign (`==`) is an assignment operator; the single equal sign (`=`) checks equality.\n","[reference here](https://stackoverflow.com/a/12948608)\n"], "#### Q75. `journald` differs from traditional logging services such as `rsyslogd` and `syslogd` because its logs are **\\_** by default.\n": ["- [ ] stored remotely\n", "- [ ] text\n", "- [x] persistent\n", "- [ ] not persistent\n","[reference here](https://sematext.com/blog/journald-logging-tutorial/#toc-journald-storage-4)\n"], "#### Q76. What is the purpose of a Mail Transport Agent (MTA)?\n": ["- [ ] It transports the mail from user's computer to the mail server.\n", "- [ ] It accepts mail and adds it to the mail queue for further processing.\n", "- [ ] It stores the mail in a mail queue waiting for the MUA to download it.\n", "- [x] It transports mail from one mail server to another.\n"], "#### Q77. What do you need to do before you can perform SSH passwordless logins?\n": ["- [x] Generate RSA or DSA key pairs using ssh-keygen.\n", "- [ ] Change the remote user's password.\n", "- [ ] Create a local SSL certificate.\n", "- [ ] Change the remote SSH configure to allow it.\n","[Reference](https://phoenixnap.com/kb/setup-passwordless-ssh)\n"], "#### Q78. When installing a downloaded package on the RedHat-based distribution manual using RPM, what may you have to do first?\n": ["- [ ] Compile the package source code.\n", "- [x] Download all dependencies and install them before installing the desired package.\n", "- [ ] Agree to an end-user license agreement.\n", "- [ ] provide the --resolve option so RPM resolves all packages dependency.\n","**[Explanation:](https://access.redhat.com/discussions/2026743)** Rpm is not meant to resolve dependencies. It checks whether required software (versions) are installed and fails when software is missing and when the wrong version of software is installed.\n"], "#### Q79. With GNU tools such as a GNU grep, awk, and sed, what is the difference between basic regular expressions (BREs) and extended regular expressions (EREs)?\n": ["- [ ] EREs can match the groups.\n", "- [ ] EREs support occurrence operators.\n", "- [ ] ERE's support alternation.\n", "- [x] only the syntax differs.\n","[Reference](https://www.gnu.org/software/sed/manual/html_node/BRE-vs-ERE.html)\n"], "#### Q80. What is the difference between reading the list of disk partitions from `/proc/partitions` and getting it using `fdisk -l`?\n": ["- [ ] `/proc/partitions` represents the disk partition table more accurately than `fdisk -l`\n", "- [ ] `/proc/partitions` shows only mounted drives. `fdisk -l` shows all drivers.\n", "- [ ] There is no difference between the two, and both lists contain the same data.\n", "- [x] `/proc/partitions` is the kernel's list of partitions held in ram. `fdisk -l` reads the partition table from the drive itself.\n"], "#### Q81. What would be in out.txt?\n": ["- [x] the content of in.txt.\n", "- [ ] the output from the command line.\n", "- [ ] Nothing, because you cannot redirect from a file (in.txt) to another file (out.txt). You can redirect only from a command to a file.\n", "- [ ] Nothing, The redirect will create a new empty file, but there will not be any output from the cat command to redirect.\n"], "#### Q82. Using alternation in a POSIX-extended regular expression, which numbers would this pattern match?\n ^(([0-9][0-9]?)|(2[0-9][0-9]))$\n": ["- [x] 0-99 and 200-299\n", "- [ ] 0-99\n", "- [ ] 200-299\n", "- [ ] 0-299\n"], "#### Q83. Typing `systemctl enable crond` does what to the crond service?\n": ["- [ ] Starts the crond service now.\n", "- [ ] Allows user to start the crond service.\n", "- [ ] Unmasks the crond service.\n", "- [x] Ensures that the crond service starts automatically on bootup.\n"], "#### Q84. Which of these features is missing from the Bash Language?\n": ["- [ ] associative arrays.\n", "- [ ] extened regular expressions.\n", "- [ ] debug traps.\n", "- [x] object orientation.\n"], "#### Q85. What is the first step to integrate extended globs into your command-line workflow?\n": ["- [ ] Nothing, extended globs are already integrated into the shell and turned on automatically.\n", "- [x] Make extended globs persistent by adding `shopt -s extglob` to a shell startup file.\n", "- [ ] Type `shopt -s extglob` into a shell one time to set the option on permanently.\n", "- [ ] Make extended globs persistent by adding `shopt +s extglob` to a shell startup file.\n"], "#### Q86. Which statement about default ACLs is true?\n": ["- [x] They provide inheritance for user and group permissions.\n", "- [ ] They work only on files.\n", "- [ ] They provide inheritance for group ownership.\n", "- [ ] They grant access to the directory on which they are set.\n","[reference:](https://www.redhat.com/sysadmin/linux-access-control-lists#setting-an-acl)\n"], "#### Q87. The object that `systemd` uses to manage services is called a \\_ file.\n": ["- [x] unit\n", "- [ ] service\n", "- [ ] single\n", "- [ ] process\n"], "#### Q88. What tool should you use to replace a physical volume in LVM?What tool should you use to replace a physical volume in LVM?\n": ["- [ ] cpcp\n", "- [ ] pvmovepvmove\n", "- [ ] tartar\n", "- [ ] lvcopy\n"], "#### Q89. What is the difference between the apt remove and apt autoremove commands?What is the difference between the apt remove and apt autoremove commands?\n": ["- [ ] The apt remove command is a link to apt autoremove, so there are no differences. The apt remove command is a link to apt autoremove, so there are no differences.\n", "- [x] Both uninstall software. The apt autoremove command also uninstalls the dependencies.Both uninstall software. The apt autoremove command also uninstalls the dependencies.\n", "- [ ] Both uninstall software. The apt remove command also uninstalls the dependencies.Both uninstall software. The apt remove command also uninstalls the dependencies.\n", "- [ ] The apt autoremove command is a system service that routinely removes unused software packages.\n","[reference:] https://dannyda.com/2021/08/19/whats-the-difference-between-apt-remove-and-apt-autoremove-what-is-apt-purge-when-to-use-debian-ubuntu-kali-linux-etc/\n"], "#### Q90. You want to extract the contents from an rpm package. Which command do you use?\n": ["- [ ] rpm --updaterpm --update\n", "- [ ] rpm -ivh --forcerpm -ivh --force\n", "- [ ] rpm --reinstallrpm --reinstall\n", "- [x] rpm2cpio\n"]}
