{"#### Q1. You open a nested sequence in order to trim the length of a clip. You make the total duration of the clips longer. What happens to the duration of the nest in the main sequence?\n": ["- [x] Nothing, the nest duration remains the same in the original sequence.\n", "- [ ] The duration of the nest changes and an overwrite edit pushes the remaining clips to make room.\n", "- [ ] The clips change speed to match the duration of the nest.\n", "- [ ] The duration of the nest changes and a ripple edit pushes the remaining clips to make room.\n"], "#### Q2. What is a good reason to use a nested sequence?\n": ["- [ ] Nesting improves playback performance.\n", "- [ ] Nesting makes it easier to reduce clutter in the Project panel, saving time and potentially project budget.\n", "- [x] Nesting allows a single effect to be applied to everything that is inside the nest, like a color correction or a video limiter.\n", "- [ ] Nesting helps Adobe Premiere Pro render faster.\n"], "#### Q3. What happens on your hard drive when you create a subclip?\n": ["- [x] Nothing, since a subclip does not create a new media file on your hard drive.\n", "- [ ] A pointer file is created on your hard drive.\n", "- [ ] A new master clip is created on your hard drive and added to the project.\n", "- [ ] A new media file is created next to the original media.\n"], "#### Q4. Which statement is _false_ regarding exporting media from Adobe Premiere Pro?\n": ["- [ ] Adobe Premiere can directly export files.\n", "- [ ] You can encode sequences into one or more formats with Adobe Media Encoder.\n", "- [ ] While using Adobe Media Encoder, you can keep working on the same sequence in Adobe Premiere Pro.\n", "- [x] When you click Export, Adobe Premiere Pro will encode the file in the background and let you continue editing.\n"], "#### Q5. While working in Premiere Pro, how can you quickly create a new After Effects composition with settings that match the current sequence?\n": ["- [ ] Select File > Adobe Dynamic Link > Import After Effects Composition.\n", "- [ ] Import a project from After Effects and choose Match project size when importing.\n", "- [x] Select File > Adobe Dynamic Link > New After Effects Composition.\n", "- [ ] Switch to After Effects and manually set up the project for accuracy.\n"], "#### Q6. Which is NOT a tag available in the Essential Sound panel?\n": ["- [x] Narration\n", "- [ ] SFX\n", "- [ ] Ambience\n", "- [ ] Music\n"], "#### Q7. HSL secondary color correction allows you to adjust which of the following? (Select three items.)\n markdown \nA. Clarity \n B. Contrast \n C. Saturation \n D. Temperature \n E. Blur \n": ["- [x] B, C, D\n", "- [ ] A, B, C\n", "- [ ] B, D, E\n", "- [ ] A, C, E\n"], "#### Q8. What is the only panel in which the Rate Stretch tool can modify a clip?\n": ["- [ ] Program Monitor panel\n", "- [ ] Source Monitor panel\n", "- [x] Timeline panel\n", "- [ ] Media Browser panel\n"], "#### Q9. What can you do to make the shape layer automatically adjust size as the text layer changes?\n ![image](images/001.png)\n": ["- [x] Select the Mask with Shape option.\n", "- [ ] Select Responsive Design and Pin To the text layer.\n", "- [ ] Select Responsive Design and Pin To the Video Frame.\n", "- [ ] Use the Align and Transform controls.\n"], "#### Q10. In which panel do you assemble media in order to create sequence?\n": ["- [ ] Timeline panel\n", "- [ ] Media Browser panel\n", "- [ ] Capture panel\n", "- [x] Source Monitor panel\n"], "#### Q11. Which panel allows you to modify video effects after they have been applied to a clip?\n": ["- [x] Effects panel\n", "- [ ] Timeline panel\n", "- [ ] Source Monitor panel\n", "- [ ] Effect Controls panel\n"], "#### Q12. Suppose your clips link to media files stored in multiple locations. You want to have the media files in a single location in their current format. Which option should you choose in the Project Manager?\n": ["- [ ] Exclude Unused Clips\n", "- [ ] Consolidate and Transcode\n", "- [x] Collect Files and Copy to New Location\n", "- [ ] Create New Trimmed Project\n"], "#### Q13. What is the default video transition in Adobe Premiere Pro?\n": ["- [ ] film dissolve\n", "- [ ] additive dissolve\n", "- [x] cross dissolve\n", "- [ ] impact dissolve\n"], "#### Q14. Which term describes the algorithm that is used to encode and decode a video file?\n": ["- [ ] container\n", "- [ ] format\n", "- [ ] compressor\n", "- [x] codec\n"], "#### Q15. You want to save a short portion of a longer clip for easy access. How can you do this?\n ![image](images/002.png)\n": ["- [ ] in the Media Browser, mark in and out points on a clip, and then import.\n", "- [ ] Mark in and out points on the clip in the Program Monitor and select choose Clip > Make Subclip.\n", "- [ ] Mark in and out points on a clip in the Timeline panel and then drag it back into a bin.\n", "- [x] Mark in and out points on the clip in the Source Monitor and select Clip > Make Subclip.\n"], "#### Q16. What adjustment can help return edge detail to video footage?\n": ["- [ ] Intensity\n", "- [ ] Contrast\n", "- [x] Sharpen\n", "- [ ] Clarity\n"], "#### Q17. Where can you adjust the duration of a transition?\n": ["- [ ] Effects panel\n", "- [ ] Project panel\n", "- [x] Effect Controls panel\n", "- [ ] Program Monitor panel\n"], "#### Q18. You are working with a new project and have been editing for two hours. What is the number of backup projects you would expect to find?\n ![image](images/003.png)\n": ["- [ ] 2\n", "- [ ] 12\n", "- [x] 20\n", "- [ ] 24\n"], "#### Q19. Which panel would you use to browse and import assets for maximum compatibility with Premiere Pro?\n": ["- [ ] Library\n", "- [ ] Effects\n", "- [ ] Project\n", "- [x] Media Browser\n","Reference : https://helpx.adobe.com/in/premiere-pro/how-to/import-with-media-browser.html#:~:text=The%20Media%20Browser%20panel%20should,with%20fragmented%20media%20file%20types.&text=To%20import%20selected%20clips%20into,on%20them%20and%20choose%20Import.\n"], "#### Q20. A transition is set to center aligned. What would be the result of dragging with the tool selected, to the right?\n ![image](images/004.png)\n": ["- [x] The transition would slide to the right.\n", "- [ ] You would extend only the right side of the transition.\n", "- [ ] You would perform a ripple edit and extend the duration of the first clip.\n", "- [ ] The transition would grow on both sides.\n"], "#### Q21. Which application does NOT support Dynamic Link?\n": ["- [ ] Adobe Photoshop\n", "- [ ] Adobe Premiere Pro\n", "- [x] Adobe Audition\n", "- [ ] Adobe After Effects\n"], "#### Q22. Which preference pane includes the Video Transition Default Duration and Audio Transition Default Duration?\n": ["- [ ] Media\n", "- [ ] Playback\n", "- [ ] General\n", "- [x] Timeline\n"], "#### Q23. If an effect has a star next to its icon, what type of effect is it?\n": ["- [ ] audio\n", "- [ ] template\n", "- [ ] transition\n", "- [x] preset\n"], "#### Q24. How was this clip manipulated using a Curves adjustment?\n ![image](images/005.png)\n": ["- [x] Hue vs. Luma\n", "- [ ] Saturation vs. Saturation\n", "- [ ] Hue vs. Saturation\n", "- [ ] Luma vs. Saturation\n"], "#### Q25. Where is transparency data stored when compositing media?\n": ["- [ ] Essential Graphics panel\n", "- [x] Effects panel\n", "- [ ] alpha channel\n", "- [ ] assembly edit\n"], "#### Q26. When part of your footage is transparent, where is the transparency information stored in the file?\n": ["- [ ] source monitor\n", "- [x] alpha channel\n", "- [ ] opacity effect\n", "- [ ] alpha effect\n"], "#### Q27. Which option allows you to reuse previously created render files for an export?\n": ["- [x] Use Previews\n", "- [ ] Use Frame Blending\n", "- [ ] Use Maximum Render Quality\n", "- [ ] Match Sequence Settings\n"], "#### Q28. In the scenario shown below, you want to extend the end of the red clip in the Timeline and not change the duration of the adjacent clip. Which is the most appropriate trim choice to accomplish this?\n ![image](images/006.png)\n": ["- [ ] Trim In\n", "- [x] Trim Out\n", "- [ ] Ripple Trim In\n", "- [ ] Ripple Trim Out\n"], "#### Q29. Which formats does Adobe Media Encoder support? (Select three items.)\n markdown\n A. GIF\n B. DCP\n C. QuickTime\n D. HEVC\n E. FLV\n": ["- [ ] A, B, C\n", "- [ ] A, C, E\n", "- [x] B, C, D\n", "- [ ] B, D, E\n"], "#### Q30. Which video file format can you export with Adobe Media Encoder? (Select three items.)\n markdown\n A. AVCHD\n B. HEVC\n C. Animated GIF\n D. MXF OP1a\n E. M4A\n": ["- [ ] A, B, C\n", "- [ ] A, C, E\n", "- [ ] B, C, D\n", "- [x] B, D, E\n"], "#### Q31. If you have placed a GPU-accelerated effect on a clip in the Timeline and have not rendered it, what color appears at the top of your Timeline?\n": ["- [x] red\n", "- [ ] blue\n", "- [ ] yellow\n", "- [ ] green\n"], "#### Q32. Which statement is true about the Appearance preferences?\n": ["- [ ] The default brightness is the halfway position between darker and lighter.\n", "- [ ] You can set the top bar of windows to a custom accent color.\n", "- [ ] You can adjust the intensity of the Focus Indicator to help easily identify which window is active.\n", "- [x] You can change the highlight color.\n"], "#### Q33. What can you tell about this transition?\n ![image](images/007.png)\n": ["- [ ] Premiere will insert white to fill the needed handles.\n", "- [ ] Premiere will insert black to fill the needed handles.\n", "- [ ] There is not enough media (handles) to cover the duration of the transition.\n", "- [ ] The transition is automatically shortened to use only the available media and the area under the diagonal lines will have no transitions applied.\n"], "#### Q34. Your project has several sequences that are no longer needed. How would you use the Project Manager to produce a new version of the project that excludes the unwanted sequences?\n": ["- [ ] Deselect the unwanted sequences in the Sequence area.\n", "- [ ] Select Create New Trimmed Project.\n", "- [ ] Select Consolidate and Transcode.\n", "- [x] Choose Collect Files and Copy to New Location.\n"], "#### Q35. You want to take a partial clip that's used in your Timeline and send it to After Effects for additional processing using Dynamic Link. Which method best accomplishes this?\n": ["- [ ] Select the clip in the Timeline and choose File > Adobe Dynamic Link > Import After Effects Composition.\n", "- [ ] Select the clip in the Timeline and choose File > Adobe Dynamic Link > Replace with After Effects Composition.\n", "- [ ] Select the clip in the Timeline and choose File > Adobe Dynamic Link > New After Effects Composition.\n", "- [ ] Select the clip in the Timeline and choose Edit > Copy. Switch to After Effects and choose Edit > Paste.\n"], "#### Q36. You want to pull down the saturation in just the clouds shown below. Which Curves adjustment makes this easiest?\n ![image](images/008.png)\n": ["- [ ] Hue vs. Saturation\n", "- [ ] RGB Curves\n", "- [ ] Luma vs. Saturation\n", "- [ ] Hue vs. Luma\n"], "#### Q37. Which is a new graphic layer type? (Select three items.)\n markdown\n A. Logo \n B. Text\n C. Rectangle\n D. Circle\n E. Ellipse\n": ["- [ ] A, B, C\n", "- [ ] A, C, E\n", "- [ ] B, C, E\n", "- [ ] B, D, E\n"], "#### Q38. Which option can create a color field that automatically adjusts size as you add or subtract from a text layer?\n ![image](images/009.png)\n": ["- [ ] Choose Fill from the Appearance controls.\n", "- [ ] Choose Stroke from the Appearance controls.\n", "- [ ] Choose Background from the Appearance controls.\n", "- [ ] Choose Shadow from the Appearance controls.\n"], "#### Q39. If you want to lighten just the darkest areas of an image, which slider should you adjust in the Lumetri effect?\n": ["- [ ] Shadows\n", "- [ ] Contrast\n", "- [ ] Midtones\n", "- [ ] Blacks\n"], "#### Q40. Looking at the histogram below, which single adjustment slider could create this change?\n ![image](images/010.png)\n": ["- [ ] Blacks\n", "- [x] Contrast\n", "- [ ] Whites\n", "- [ ] Exposure\n"], "#### Q41. Under which drop-down menu can you remove effects?\n": ["- [ ] Sequence\n", "- [ ] File\n", "- [ ] Edit\n", "- [ ] Clip\n"], "#### Q42. Which adjustment can you use to quickly convert log footage using recommended settings by a camera manufacturer?\n": ["- [ ] Creative Look\n", "- [ ] Faded Film\n", "- [ ] Input LUT\n", "- [ ] Intensity\n"], "#### Q43. Which Audio Mixer automation mode allows an automation to return to the previous state after any adjustments are made?\n": ["- [ ] Touch\n", "- [ ] Latch\n", "- [ ] Write\n", "- [ ] Read\n"], "#### Q44. You want Premiere Pro to create a second instance of your media files and add an additional version at a draft resolution. Which option works best in the ingest settings?\n": ["- [ ] Transcode\n", "- [ ] Copy and Create Proxies\n", "- [ ] Create Proxies\n", "- [ ] Copy\n"], "#### Q45. If you've imported several time-lapse sequences into your project as image sequences, which option in the Project Manager is most useful for archiving the project?\n": ["- [ ] Convert Image Sequences to Clips\n", "- [ ] Convert After Effects Compositions to Clips\n", "- [ ] Include Preview Files\n", "- [ ] Consolidate and Transcode\n"], "#### Q46. Which option is enabled to affect the view of the audio waveforms as shown below?\n ![image](images/011.png) \n": ["- [ ] Show Audio Time Units\n", "- [ ] Rectified Audio Waveform\n", "- [ ] Large Audio Waveforms\n", "- [ ] Logarithmic Keyframe Scaling\n"], "#### Q47. You want to float the History panel independently to position it on another monitor as a floating window. Which option in the panel's submenu should you select?\n": ["- [ ] Undock Panel\n", "- [ ] Undock Frame\n", "- [ ] Maximize Panel\n", "- [ ] Maximize Frame\n"], "#### Q48. To quickly arrange the panels in Adobe Premiere Pro for a specific task, what do you use?\n ": ["- [x] workspaces\n", "- [ ] layouts\n", "- [ ] panel presets\n", "- [ ] events"]}