{"#### Q1. Which file contains all the drawing document-specific information, such as specifications for units, drafting standard, font selections, etc?\n": ["- [x] SOLIDWORKS drawing template\n", "- [ ] SOLIDWORKS composer file\n", "- [ ] SOLIDWORKS part file\n", "- [ ] SOLIDWORKS sheet format\n","[Reference : drawing template](https://www.cati.com/blog/2017/07/tech-tip-the-difference-between-a-sheet-format-and-a-drawing-template-in-solidworks/#:~:text=The%20drawing%20template%20has%20the,pre%2Ddefined%20views%2C%20etc.)\n"], "#### Q2. You need to design a steel spring with a pitch diameter of 3 inches, free length of 10 inches, and pitch of 1 inch. How would you accomplish this in SOLIDWORKS?\n": ["- [ ] Create a new sketch of a circle with a diameter of 1 inch. Then use the Helix/Spiral curve command and define a height of 10 inches and pitch of 3 inches.\n", "- [x] Create a new sketch of a circle with a diameter of 3 inches. Then use the Helix/Spiral curve command to define a height of 10 inches and pitch of 1 inch.\n", "- [ ] First, create a new sketch of a circle of 10 inches. Then use the Helix/Spiral curve command and define by pitch of 1 inch and 3 revolutions.\n", "- [ ] Use the Helix/Spiral curve command and define a diameter of 3 inches, height of 10 inches, and pitch of 1 inch.\n"], "#### Q3. Which single feature could you use to create this image?\n ![solidworks image](images/solidworks_q3.jpg)\n": ["- [ ] Loft\n", "- [ ] Extruded Boss/Base\n", "- [x] Sweep\n", "- [ ] Revolved Boss/Base\n"], "#### Q4. Which choice is NOT a fillet type in SOLIDWORKS?\n": ["- [ ] constant size\n", "- [ ] variable size\n", "- [ ] face\n", "- [x] angled\n"], "#### Q5. Your sketch is not extruding correctly. It does not seem to be a properly closed contour, although from a simple visual inspection, it looks to be fully closed. You think perhaps there are some very small gaps in your contour that are causing the issue. What tool can you use to find these small gaps?\n": ["- [ ] Quick Snaps\n", "- [ ] Rebuild\n", "- [x] Repair Sketch\n", "- [ ] Show Error\n","[reference](https://blogs.solidworks.com/tech/2016/12/solidworks-fix-sketch-repair-sketch.html)\n"], "#### Q6. Which choice is an example of a skected feature?\n": ["- [ ] chamfer\n", "- [x] extrusion\n", "- [ ] fillet\n", "- [ ] shell\n","[Reference](https://help.solidworks.com/2016/English/SolidWorks/acadhelp/c_Feature_based_Models.htm)\n"], "#### Q7. You want to make two circles have the same center point within a SOLIDWORKS sketch. How can you do this?\n": ["- [ ] Add a tangent relation between the circles\n", "- [x] Add a concentric relation between the circles\n", "- [ ] Add a horizontal relation between the circles\n", "- [ ] Add an equal relation between the circles\n"], "#### Q8. Which reference geometry is NOT available in SOLIDWORKS?\n": ["- [x] sphere\n", "- [ ] plane\n", "- [ ] point\n", "- [ ] axis\n","[Reference](https://www.cati.com/blog/2020/02/solidworks-basics-of-reference-geometry-axis/)\n"], "#### Q9. Specifying two lines to be perpendicular to each other would be an example of what?\n": ["- [ ] feature\n", "- [x] relation\n", "- [ ] extrude\n", "- [ ] dimension\n","[Solidworks: Sketch Relations](https://help.solidworks.com/2022/english/SolidWorks/sldworks/c_Description_of_Sketch_Relations.htm)\n"], "#### Q10. You want to focus on a single component within your assembly and hide all the rest. How can you do this?\n": ["- [ ] Right-click the component you want to focus on and select Change Transparency\n", "- [ ] Right-click the component you want to focus on and select Hide\n", "- [x] Right-click the component you want to focus on and select Isolate\n", "- [ ] Right-click the component you want to focus on and select Suppress\n","[Solidworks: Isolate](https://help.solidworks.com/2022/english/SolidWorks/sldworks/hidd_comp_isolate_dlg.htm?verRedirect=1)\n"], "#### Q11. What will Save As do on an existing saved part?\n": ["- [ ] It will delete the original part and save the current part with a new name\n", "- [x] It will keep the original part and save the current path with a new name\n", "- [ ] It will save both the original part and the new part in the current state\n", "- [ ] It will rename the original part\n","[Reference](https://help.solidworks.com/2022/English/SolidWorks/sldworks/AFX_HIDD_FILESAVE.htm)"], "#### Q12. You want to show a list of the raw materials, subassemblies, intermediate assemblies, subcomponents, and parts, and the quantities of each, needed to manufacture an end product. What would be useful to accomplish this?\n": ["- [x] bill of material\n", "- [ ] isometric view\n", "- [ ] exploded view\n", "- [ ] hole list\n","[Reference](https://en.wikipedia.org/wiki/Bill_of_materials)\n"], "#### Q13. Freezing a portion of a model can be used if you work with complex models with many features. Why\n": ["- [ ] Freezing the features helps to show only the critical features of the model\n", "- [ ] Freezing the features helps to show the internal features of the model\n", "- [x] Freezing the features helps to reduce the rebuild time and prevent unintentional changes to the model\n", "- [ ] Freezing the features helps to show the external features of the model\n","[Reference](https://help.solidworks.com/2021/English/SolidWorks/sldworks/c_Feature_Freeze.htm)"], "#### Q14. Which single features could you use to design a cube, a sphere, and a paperclip, respectively?\n": ["- [ ] Revolved Boss/Base, Shell, and Sweep\n", "- [ ] Shell, Revolved Boss/Base, and Extruded Boss/Base\n", "- [x] Extruded Boss/Base, Revolved Boss/Base, and Sweep\n", "- [ ] Draft, Extruded Boss/Base, and Shell\n"], "#### Q15. Which choice is NOT a standard mate within SOLIDWORKS?\n": ["- [ ] parallel\n", "- [ ] coindicent\n", "- [x] equal\n", "- [ ] concentric\n","[Reference](https://help.solidworks.com/2019/English/SolidWorks/sldworks/r_Types_of_Mates_SWassy.htm)"], "#### Q16. How would you temporarily remove a feature from a model?\n": ["- [x] Click the feature in the FeatureManager design tree or graphics area, then select Suppress\n", "- [ ] Drag the feature to the Suppression folder, located at the top of the FeatureManager design tree\n", "- [ ] You cannot remove features temporarily-you can only delete them completely\n", "- [ ] Drag the feature to the bottom of the FeatureManager design tree, then drag the Suppression bar above it\n","[Reference](https://help.solidworks.com/2022/English/SolidWorks/sldworks/c_Suppress_and_Unsuppress_Features.htm)\n"], "#### Q17. You want to show an assembly's components spread out and positioned to show how they fit together when assembled. How do you accomplish this?\n": ["- [ ] Use Assembly Visualization\n", "- [ ] Use a bill of materials\n", "- [ ] Use isometric view\n", "- [x] Use exploded view\n","[Reference](https://help.solidworks.com/2018/english/solidworks/sldworks/c_Exploded_Views_in_Assemblies.htm)\n"], "#### Q18. How would you fix a Lofted Boss/Base feature that appears twisted?\n": ["- [x] Drag the loft connectors to the correct position, or use guide curves\n", "- [ ] Reduce the spacing between the loft profiles, then scale the loft body as required\n", "- [ ] Loft shapes are driven entirely by the loft profiles, adjust the skecthes to remove any ambiguity in the loft path\n", "- [ ] Ensure that the Twist Along Path option is not selected\n","[Reference](https://help.solidworks.com/2022/English/SolidWorks/sldworks/c_Recommendations_Lofts_Guide_Curves.htm)"], "#### Q19. When creating a sweep feature, you receive this error: \"Cannot get to a point on the path to start with. For an open path, the path must intersect with the section plane.\" How can you fix this?\n": ["- [x] Ensure that the path sketch touches the profile sketch at some point\n", "- [ ] Select the Path Merge option within the sweep feature\n", "- [ ] Select the Path Intersection option within the sweep feature\n", "- [ ] Edit the path sketch and reduce any areas of tight curvature\n"], "#### Q20. With injection molding, one common manufacturing requirement or preference is applying a taper or angle to faces to help with part removal from the mold. Which feature can help you meet this requirement?\n": ["- [ ] Loft\n", "- [x] Draft\n", "- [ ] Wrap\n", "- [ ] Sweep\n"], "#### Q21. You want to simplify a very large and complex assembly to improve performance while working within it. What should you use?\n": ["- [ ] DFMXpress\n", "- [x] SpeedPak\n", "- [ ] a flexible subassembly\n", "- [ ] Design Checker\n","[reference](https://help.solidworks.com/2014/english/SolidWorks/sldworks/c_Improving_Large_Assembly_Performance_SWassy.htm\n"], "#### Q22. If you are working with ISO standards, which projection method would you most likely be using?\n": ["- [ ] second angle projection\n", "- [ ] fourth angle projection\n", "- [x] first angle projection\n", "- [ ] third angle projection\n","[Reference](https://www.mcadcafe.com/nbc/articles/1/1551676/Which-standard-should-you-adopt-2D-Drawing-ISO-ASME)\n"], "#### Q23. You have a single line within a sketch that you would like to split into three separate lines. How can you achieve this?\n": ["- [ ] Use the Offset Entities tool\n", "- [x] Use the Split Line tool\n", "- [ ] Use the Split Entities tool\n", "- [ ] Use the Split tool\n"], "#### Q24. What controls the direction and magnitude of a spline curvature?\n": ["- [ ] inflection point\n", "- [ ] control point\n", "- [ ] spline point\n", "- [x] spline handle\n","[Reference](https://www.cati.com/blog/2016/06/creating-splines-in-solidworks-made-easy/)\n"], "#### Q25. You want to build a new part within an assembly to ensure in-context relations and dimensions. You also want to save out this part file as its own unique file. After navigating to the Assembly ribbon tab, what do you do next?\n": ["- [ ] Under Insert Component, select Part to create a new in-context part. Right-click the new part and select isolate\n", "- [ ] Select Insert Component to create a new in-context part. Right-click te new part and select Save Part (in External File)\n", "- [ ] Under Insert Components, select New Part to create a new in-context part. Right-click the new part and select Save Selection\n", "- [x] Under Insert Components, select New Part to create a new in-context part. Right-click the new part and select Save Part (in External File)\n","[Reference](https://help.solidworks.com/2018/english/SolidWorks/sldworks/t_Creating_a_Part_in_an_Assembly.htm)\n"], "#### Q26. The ribbon bar at the top of your SOLIDWORKS screen has disappeared. How can you get it back?\n": ["- [ ] Click View > Toolbars > CommandManager\n", "- [ ] Click View > Toolbars > FeatureManager\n", "- [ ] Click View > Toolbars > MotionManager\n", "- [x] Click View > Toolbars > Task Pane\n","[reference](https://www.javelin-tech.com/blog/2017/02/solidworks-task-pane-missing/)\n"], "#### Q27. Representing a three-dimensional object by a number of two-dimensional views is generally called\n": ["- [ ] isometric projection\n", "- [ ] oblique projection\n", "- [ ] object projection\n", "- [x] orthographic projection\n","[Reference](https://www.britannica.com/technology/orthographic-projection-engineering)\n"], "#### Q28. How can you rename a feature?\n": ["- [x] Select the feature name and press F2, or slow-double-click the feature name\n", "- [ ] Select the feature name and press F3 key, or right-click the feature name\n", "- [ ] Select the feature name and press F7, or quick-double-click the feature name\n", "- [ ] Select the feature name and press F5 key, or double-click the feature name\n","[reference](http://support.ptc.com/help/creo/creo_pma/usascii/index.html#page/part_modeling/part_modeling/part_five_sub/To_Rename_a_Feature.html)"], "#### Q29. When using the Fillet tool, what does the Tanget Propagation option do?\n": ["- [ ] It creates a fillet that is tanget to the direction of view\n", "- [ ] It creates a fillet that varies in size, depending on lcoal tangency\n", "- [ ] It creates a constant-size fillet around all selections\n", "- [x] It extends the fillet to all faces that are tangent to the selected face\n","[Reference](https://help.solidworks.com/2022/english/swconnected/swdotworks/c_example_tangent_propagation.htm)\n"], "#### Q30. You notice that one of the subassemblies in your main assembly is rigid and does not have mobility it should. How can you resolve this issue?\n": ["- [x] Select the subassembly and then select **Make Subassembly Flexible** from the context menu\n", "- [ ] Select the subassembly and then select **Set Resolved from LightWeight** from the context menu\n", "- [ ] Select the subassembly and then select **Edit Assembly** from the context menu\n", "- [ ] Select the subassembly and then select **Make Independent** from the context menu\n","[Reference](https://help.solidworks.com/2018/english/solidworks/sldworks/c_flexible_sub-assemblies.htm)\n"], "#### Q31. You dimension an arc in a drawing and notice that the dimension is coming in as the radius value. You want to show the diameter value. To do this, first you click the dimension to open the dimension PropertyManager. What do you do next?\n": ["- [x] On the **Leaders** tab, select **Diameter**\n", "- [ ] On the **Other** tab, select **Diameter**\n", "- [ ] On the **Value** tab, and select **Diameter**\n", "- [ ] On the **Value** tab, seect **Override Value**\n"], "#### Q32. In the image below, which are the parents and children of the Vertical Boss Feature?\n ![solidworks image](images/solidworks_q32.png)\n": ["- [x] The parent is Base Feature; the children are Slot Cutout, Sketch3, CBORE Hole, and Fillet2\n", "- [ ] The parent is Vertical Boss; the childre are Base Feature, Slot Cutout, Sketch3, CBORE Hole, and Fillet2\n", "- [ ] The parent is Base Feature; the children are Vertical Boss, Slot Cutout, Sketch3, CBORE Holde, and Fillet2\n", "- [ ] The parents are Vertical Boss and Base Feature; the children are Slot Cutout, Sketch3, CBORE Hole, and Fillet2\n"], "#### Q33. In this image, which parts are fixed?\n ![solidworks image](images/solidworks_q33.png)\n": ["- [ ] BASE\n", "- [ ] LINK 3\n", "- [x] LINK 5\n", "- [ ] LINK 1\n","[Reference](https://help.solidworks.com/2022/English/SolidWorks/sldworks/t_Fixing_the_Position_of_a_Component.htm)\n"], "#### Q34. What is this image an example of?\n ![solidworks image](images/solidworks_q34.png)\n": ["- [x] a hole table\n", "- [ ] a revision table\n", "- [ ] a tolerance table\n", "- [ ] a punch table\n","[Reference](https://help.solidworks.com/2022/English/SolidWorks/sldworks/c_hole_tables.htm)\n"], "#### Q35. What type of dimensioning is shown here?\n ![solidworks image](images/solidworks_q35.png)\n": ["- [ ] smart dimensioning\n", "- [ ] angular running dimensioning\n", "- [x] ordinate dimensioning\n", "- [ ] chain dimensioning\n"], "#### Q36. In the image below, what types of hole are A1 and B1 respectively?\n ![solidworks image](images/solidworks_q36.png)\n": ["- [ ] countersink and counterbore\n", "- [x] counterbore and countersink\n", "- [ ] standard and threaded/tapped\n", "- [ ] threaded/tapped and standard\n"], "#### Q37. What is this sketch an example of?\n ![solidworks image](images/solidworks_q37.png)\n": ["- [x] an open contour sketch\n", "- [ ] a multi-contour or intersecting sketch\n", "- [ ] a triple contour sketch\n", "- [ ] a closed contour sketch\n"], "#### Q38. Can this skecth be extruded?\n": ["- [ ] Yes, you can extrude it using the standard extrude boss option\n", "- [ ] Yes, you can extrude it using the Selected Contours option\n", "- [ ] No, the sketch is an open contour and this cannot be extruded\n", "- [x] Yes, you can extrude it using the Thin Feature option\n"], "#### Q39. Why is it useful to suppress a feature?\n": ["- [ ] Suppressing changes the color of a feature. This is useful to help easily distinguish between different features.\n", "- [x] Suppressing removes a feature from a model, but does not delete it. This is useful if you need that feature back in the future.\n", "- [ ] Suppressing removes a feature from a model forever. This is useful if you no longer need that feature.\n", "- [ ] Suppressing makes a feature transparent. This is useful if you ever need to see through a feature when modeling.\n"], "#### Q40. Which choice is not a standard view orientation in SOLIDWORKS?\n": ["- [ ] back\n", "- [x] down\n", "- [ ] right\n", "- [ ] front\n"], "#### Q41. What type of view is used to show a portion of some parent view, usually at an enlarged scale?\n": ["- [x] detail view\n", "- [ ] auxiliary view\n", "- [ ] break view\n", "- [ ] section view\n"], "#### Q42. How can you create relationships between parts within an assembly?\n": ["- [x] Use mates.\n", "- [ ] Use constraints.\n", "- [ ] Use relations.\n", "- [ ] Use dimensions.\n"], "#### Q43. What is required to create a solid using the Swept Boss/Base tool?\n": ["- [x] a profile and a path\n", "- [ ] a sketch and an axis of revolution\n", "- [ ] atleast two profiles\n", "- [ ] a sketch\n"], "#### Q44. Which statement best describes the term \"parametric modeling\"?\n": ["- [ ] This type of modeling is often compared to working with modeling clay.\n", "- [x] The dimensions and relations used to create a feature are captured and stored in the model.\n", "- [ ] You can simply push and pull the geometry until you arrive at the shape you require.\n", "- [ ] Dimensions and relations are not captured or stored within the model.\n"], "#### Q45. What is required to create a solid using the Extruded Boss/Base tool?\n": ["- [ ] at least two profiles\n", "- [ ] a sketch and an axis of revolution\n", "- [x] a sketch\n", "- [ ] a profile and a path\n"], "#### Q46. Which choice is an example of an applied feature?\n": ["- [ ] extrusion\n", "- [ ] revolve\n", "- [x] fillet\n", "- [ ] sweep\n"], "#### Q47. How can you change the size of a toolbox screw in an assembly?\n": ["- [x] Right-click the component and select Edit Toolbox Component.\n", "- [ ] Toolbox part sizes cannot be changed once added. You have to delete the screw and then readd one of the correct size.\n", "- [ ] Edit the screw part and add a scale feature using only the required axes.\n", "- [ ] Open the screw part, then manually adjust the dimensions and save as a copy.\n"], "#### Q48. Which choice is not a standard 3D view in SOLIDWORKS?\n": ["- [ ] dimetric\n", "- [ ] trimetric\n", "- [ ] isometric\n", "- [x] oblique\n"], "#### Q49. You are designing a robotic arm assembly. You want the first link of the arm to be able to rotate about the base, but only a total of 270 degrees from the start point and no further. How would you achieve this?\n": ["- [ ] Use an Angle mate.\n", "- [ ] Use a Mechanical mate.\n", "- [x] Use a Limit Angle mate\n", "- [ ] Use a Gear mate.\n"], "#### Q50. How can you reattach a broken reference in a derived split part?\n": ["- [ ] Right-click the filename at the top of the FeatureManager design tree and select Relink Stock Part.\n", "- [ ] Once derived part references are broken, they cannot be readded. Consider resplitting the part.\n", "- [ ] Locate the child part using SOLIDWORKS Explorer and select Relink Parent.\n", "- [x] Edit the stock feature at the start of the FeatureManager design tree, then adjust the Defining Stock Part option.\n","[Reference](https://help.solidworks.com/2022/English/SolidWorks/sldworks/HIDD_FEAT_EDIT_SPLIT_FEAT_BODY.htm)\n"], "#### Q51. You have designed a plastic part that you want to split and save in two separate unique parts. You use the Split tool to split the part in half and create the two bodies. What do you do next?\n": ["- [ ] Navigate to the Solid Bodies folder, right-click the body name, and select Isolate to save to a new file. Repeat for the other body.\n", "- [ ] Within the Split tool, select Consume Bodies.\n", "- [ ] Within the Split tool, select Save as New Files.\n", "- [x] Within the Split tool, click File, double-click the body name, type a name for the new part, and click Save.\n"], "#### Q52. What is required to create a new 2D sketch?\n": ["- [ ] any existing geometry\n", "- [ ] any existing plane or curved face\n", "- [x] any existing plane or planar face\n", "- [ ] any planar or curved surface\n"], "#### Q53. You want to enlarge your current design by 3%. What tool would you use?\n": ["- [ ] Extrude\n", "- [ ] Loft\n", "- [x] Scale\n", "- [ ] Truncate\n"], "#### Q54. Earlier within your part design, you created a sketch. Now you want to make a copy of this sketch to use on a different plane or face. You want to ensure that the two sketches will always be the same, so that if you modify the original sketch, the new sketch is updated to reflect the same changes. How can you achieve this?\n": ["- [ ] Copy and paste the original sketch.\n", "- [ ] Copy and paste the original sketch using Paste Special.\n", "- [ ] Create a composite sketch.\n", "- [x] Create a derived sketch.\n"], "#### Q55. When creating sketches, small boxes show up next to the sketch lines. What are these boxes called?\n": ["- [ ] check boxes\n", "- [ ] locks\n", "- [ ] statuses\n", "- [x] relations\n"], "#### Q56. You notice your sketch is blue. How can you make your sketch fully defined?\n": ["- [ ] Add in any additional required features.\n", "- [x] Add in the additional dimensions or relations.\n", "- [ ] Nothing, the sketch is already fully defined.\n", "- [ ] Remove any additional dimensions or relations.\n"], "#### Q57. Which sketch relation can you NOT apply to a rectangle?\n": ["- [ ] coincident\n", "- [ ] collinear\n", "- [x] concentric\n", "- [ ] fix\n"]}